[
  {
    "id": "n1",
    "title": "Personal Use: Out of Scope",
    "description": "You are using this AI system for purely personal, non-professional activities, which are out of the AI Act scope (Article 2). You have no obligations",
    "requiredTags": [
      "legal:non-professional"
    ],
    "order": 1
  },
  {
    "id": "n2",
    "title": "Organization is established in the EU",
    "description": "Organizations registered or headquartered in an EU Member State are directly subject to the EU Artificial Intelligence Act (AI Act). This includes all legal entities (companies, organizations, associations) established anywhere within the territory of the European Union.",
    "requiredTags": [
      "legal:eu-entity"
    ]
  },
  {
    "id": "n3",
    "title": "AI System does not meet defintion",
    "description": "Your system does not meet the AI definition under the EU AI Act.\n\nAccording to Article 3 of the EU AI Act, an AI system is defined as a “machine-based system designed to operate with varying levels of autonomy and that may exhibit adaptiveness after deployment, which, for explicit or implicit objectives, infers from the input it receives how to generate outputs such as predictions, content, recommendations, or decisions that can influence physical or virtual environments.”\n\nSince your system does not fit this definition, the EU AI Act does not apply. You do not have legal obligations under this regulation for this system.\n\nTip: If your system changes in the future to include machine-based inference, adaptability, or autonomous decision-making, you should reassess its status under the Act at that time.",
    "requiredTags": [
      "ai-system:not-meets-definition"
    ]
  },
  {
    "id": "n4",
    "title": "Your system meets the EU AI Act definition of an AI system.",
    "description": "According to Article 3 of the EU AI Act, an AI system is “a machine-based system designed to operate with varying levels of autonomy and that may exhibit adaptiveness after deployment, which, for explicit or implicit objectives, infers from the input it receives how to generate outputs such as predictions, content, recommendations, or decisions that can influence physical or virtual environments.”\n\nBecause your system fits this definition, it may be subject to obligations under the EU AI Act depending on other factors, such as its use, risk level, and market placement.",
    "requiredTags": [
      "ai-system:meets-definition"
    ]
  },
  {
    "id": "n5",
    "title": "Your AI system is out of scope of the EU AI Act.",
    "description": "Because you do not place this AI system on the EU market and its outputs are not used within the EU, the EU AI Act does not apply in your case.\n\nYou are not required to meet compliance obligations under this regulation for this system.\nIf, at any point in the future, you intend to make the system available in the EU or its outputs are used by EU-based individuals or organizations, you should reassess your obligations under the EU AI Act.",
    "requiredAllTags": [
      "legal:not-places-on-eu",
      "legal:not-output-in-eu"
    ]
  },
  {
    "id": "n6",
    "title": "Your AI system is exempt from the EU AI Act.",
    "description": "Because this system is used exclusively for military, scientific research, or national security purposes, it is explicitly excluded from the scope of the EU AI Act under Article 2. This means you do not have compliance obligations for this system under this regulation.\n\nIf the purpose of this AI system changes in the future, or if it is used outside these exclusive contexts, please reassess its status under the Act.",
    "requiredTags": [
      "ai-system:exempt-military",
      "ai-system:exempt-research",
      "ai-system:exempt-security"
    ]
  },
  {
    "id": "n7",
    "title": "Your AI system is subject to the EU AI Act.",
    "description": "Since your system is not used exclusively for military, scientific research, or national security purposes, it falls within the scope of the EU AI Act.  \n\nYou should continue with the compliance assessment to determine your specific obligations under the regulation, based on the system’s use, risk category, and your organization’s role.  \n\n_If you are unsure about the correct classification, review your intended use cases and deployment contexts, or consult further guidance._",
    "requiredTags": [
      "ai-system:not-exempt"
    ]
  },
  {
    "id": "n8",
    "title": "Outputs of your AI system will be used within the European Union.",
    "description": "You have indicated that the outputs of your AI system will be used within the European Union.  \n\nUnder the EU AI Act, the regulation can apply even if your organization or the AI system itself is not based in the EU, as long as its results, predictions, or decisions are used by individuals or organizations within the EU.\n\n _If you plan to expand or change where your system’s outputs are used, be sure to reassess applicability as needed._",
    "requiredTags": [
      "legal:output-in-eu"
    ]
  }
]