[
  {
    "id": "n1",
    "title": "Personal Use: Out of Scope",
    "description": "You are using this AI system for purely personal, non-professional activities, which are out of the AI Act scope (Article 2). You have no obligations",
    "requiredTags": [
      "legal:non-professional"
    ],
    "order": 1
  },
  {
    "id": "n2",
    "title": "Organization is established in the EU",
    "description": "Organizations registered or headquartered in an EU Member State are directly subject to the EU Artificial Intelligence Act (AI Act). This includes all legal entities (companies, organizations, associations) established anywhere within the territory of the European Union.",
    "requiredTags": [
      "legal:eu-entity"
    ]
  },
  {
    "id": "n3",
    "title": "AI System does not meet defintion",
    "description": "Your system does not meet the AI definition under the EU AI Act.\n\nAccording to Article 3 of the EU AI Act, an AI system is defined as a “machine-based system designed to operate with varying levels of autonomy and that may exhibit adaptiveness after deployment, which, for explicit or implicit objectives, infers from the input it receives how to generate outputs such as predictions, content, recommendations, or decisions that can influence physical or virtual environments.”\n\nSince your system does not fit this definition, the EU AI Act does not apply. You do not have legal obligations under this regulation for this system.\n\nTip: If your system changes in the future to include machine-based inference, adaptability, or autonomous decision-making, you should reassess its status under the Act at that time.",
    "requiredTags": [
      "ai-system:not-meets-definition"
    ]
  },
  {
    "id": "n4",
    "title": "Your system meets the EU AI Act definition of an AI system.",
    "description": "According to Article 3 of the EU AI Act, an AI system is “a machine-based system designed to operate with varying levels of autonomy and that may exhibit adaptiveness after deployment, which, for explicit or implicit objectives, infers from the input it receives how to generate outputs such as predictions, content, recommendations, or decisions that can influence physical or virtual environments.”\n\nBecause your system fits this definition, it may be subject to obligations under the EU AI Act depending on other factors, such as its use, risk level, and market placement.",
    "requiredTags": [
      "ai-system:meets-definition"
    ]
  },
  {
    "id": "n5",
    "title": "Your AI system is out of scope of the EU AI Act.",
    "description": "Because you do not place this AI system on the EU market and its outputs are not used within the EU, the EU AI Act does not apply in your case.\n\nYou are not required to meet compliance obligations under this regulation for this system.\nIf, at any point in the future, you intend to make the system available in the EU or its outputs are used by EU-based individuals or organizations, you should reassess your obligations under the EU AI Act.",
    "requiredAllTags": [
      "legal:not-places-on-eu",
      "legal:not-output-in-eu"
    ]
  },
  {
    "id": "n6",
    "title": "Your AI system is exempt from the EU AI Act.",
    "description": "Because this system is used exclusively for military, scientific research, or national security purposes, it is explicitly excluded from the scope of the EU AI Act under Article 2. This means you do not have compliance obligations for this system under this regulation.\n\nIf the purpose of this AI system changes in the future, or if it is used outside these exclusive contexts, please reassess its status under the Act.",
    "requiredTags": [
      "ai-system:exempt-military",
      "ai-system:exempt-research",
      "ai-system:exempt-security"
    ]
  },
  {
    "id": "n7",
    "title": "Your AI system is subject to the EU AI Act.",
    "description": "Since your system is not used exclusively for military, scientific research, or national security purposes, it falls within the scope of the EU AI Act.  \n\nYou should continue with the compliance assessment to determine your specific obligations under the regulation, based on the system’s use, risk category, and your organization’s role.  \n\n_If you are unsure about the correct classification, review your intended use cases and deployment contexts, or consult further guidance._",
    "requiredTags": [
      "ai-system:not-exempt"
    ]
  },
  {
    "id": "n8",
    "title": "Outputs of your AI system will be used within the European Union.",
    "description": "You have indicated that the outputs of your AI system will be used within the European Union.  \n\nUnder the EU AI Act, the regulation can apply even if your organization or the AI system itself is not based in the EU, as long as its results, predictions, or decisions are used by individuals or organizations within the EU.\n\n _If you plan to expand or change where your system’s outputs are used, be sure to reassess applicability as needed._",
    "requiredTags": [
      "legal:output-in-eu"
    ]
  },
  {
    "id": "n9",
    "title": "AI System is not considered as legacy system.",
    "description": "Since you indicated that the  AI system was not placed on the EU market (or put into service in the EU) before 2 August 2025, it does **not** qualify as a “legacy” or pre-existing system under the EU Artificial Intelligence Act.  \n\nThis means your system will be subject to the **full requirements of the AI Act** when they come into legal effect. You must:\n- Conduct a full risk assessment based on the system’s type and use context.\n- Undertake a conformity assessment and complete required technical documentation.\n- Implement all mandatory obligations for your system’s AI risk category, including requirements for high-risk, general-purpose, or other regulated AI       systems.\n- Ensure compliance with transparency, human oversight, data quality, cybersecurity, incident reporting, and ongoing risk management provisions as detailed in the AI Act.",
    "requiredTags": [
      "ai-system:non-legacy-system"
    ]
  },
  {
    "id": "n10",
    "title": " AI system is considered a “legacy”",
    "description": "Your AI system is considered a “legacy” or pre-existing system under the EU Artificial Intelligence Act.  \n\nThis means that, depending on whether your system undergoes any significant modifications after 2 August 2025:\n- If your system **remains unchanged**, you benefit from transitional provisions and are subject to a limited set of ongoing obligations.  \n  - You must maintain technical documentation, retain relevant logs, continue risk management, and cooperate with authorities if requested.  \n  - Full retraining or conformity reassessment is not required unless specifically triggered by sectoral law or a change in system use.\n- If your system **is significantly modified or upgraded** after 2 August 2025, you will be required to fully comply with all relevant obligations under the AI Act (including risk assessments and conformity procedures) as if it was a newly placed system.",
    "requiredTags": [
      "ai-system:legacy-system"
    ]
  },
  {
    "id": "n11",
    "title": "AI System is a modified legacy system",
    "description": "Since your system has been modified or upgraded since 2 August 2025, it is considered subject to the **full requirements of the AI Act**.  \nYou must comply with all applicable obligations, including:\n- Conducting comprehensive risk and fundamental rights impact assessments,\n- Undergoing conformity assessment procedures,\n- Ensuring appropriate human oversight,\n- Maintaining up-to-date technical documentation and incident reporting,\n- Meeting all other requirements for your system's risk category.\n\nTreat your system as if it is being newly placed on the EU market under the latest AI Act rules.",
    "requiredTags": [
      "ai-system:legacy-system-w-changes"
    ]
  },
  {
    "id": "n12",
    "title": "Not modified legacy AI system",
    "description": "Since your system has **not** been modified or upgraded since 2 August 2025, it remains a “legacy” system covered by transitional provisions under the AI Act.  \nYou must continue to fulfill essential obligations including:\n- Maintaining technical documentation,\n- Implementing risk management practices and ongoing monitoring,\n- Retaining logs and incident records,\n- Cooperating with EU authorities upon request.\n\nHowever, **full retraining or comprehensive re-assessment of the system is generally not required** for unchanged legacy systems, unless specifically mandated by sectoral or national law.",
    "requiredTags": [
      "ai-system:legacy-system-wo-changes"
    ]
  },
  {
    "id": "n13",
    "title": "You play a role as provider",
    "description": "Your organization is acting as a provider because you have indicated that you develop, commission the development of, or place this AI system on the market under your name or trademark. As a provider, you are primarily responsible for ensuring compliance with the EU AI Act, including technical documentation, conformity obligations, and post-market monitoring. This includes managing the AI system's compliance throughout its lifecycle and cooperating with regulatory authorities.",
    "requiredTags": [
      "role:provider"
    ]
  },
  {
    "id": "n14",
    "title": "You play a role as deployer ",
    "description": "Your organization is identified as a deployer since you have indicated you use or operate this AI system within your organization, or under your authority, beyond purely personal or non-professional activities. As a deployer, you must ensure the responsible and lawful operation of the AI system, follow transparency obligations, and implement any required oversight and risk mitigation measures stipulated by the EU AI Act.",
    "requiredTags": [
      "role:deployer"
    ]
  },
  {
    "id": "n15",
    "title": "You play a role as distributor",
    "description": "Your organization is classified as a distributor as you make this AI system available in the EU supply chain without being its provider or importer and without altering its intended purpose. Distributors have the responsibility to verify that the AI system is properly documented, CE marked where required, and supplied with all mandatory instructions and information according to EU AI Act rules.",
    "requiredTags": [
      "role:distributor"
    ]
  },
  {
    "id": "n16",
    "title": "You integrate AI as a product manufacturer",
    "description": "Your organization plays the role of product manufacturer integrating AI because you incorporate this AI system into your own products (such as machinery, vehicles, or equipment) and market the combined product under your name or trademark. In this role, you are responsible for ensuring both your finished product and its embedded AI functionalities meet all relevant regulatory and safety requirements, including those of the EU AI Act.",
    "requiredTags": [
      "role:product-manufacturer"
    ]
  },
  {
    "id": "n17",
    "title": "You act as an authorized representative",
    "description": "You are recognized as the authorized representative since you have been officially appointed to represent a non-EU provider for this AI system within the EU. As an authorized representative, you serve as the main contact point for EU authorities, maintain technical documentation, and fulfill compliance responsibilities on behalf of the provider as specified by the EU AI Act.",
    "requiredTags": [
      "role:authorized-representative"
    ]
  },
  {
    "id": "n18",
    "title": "You play a role as importer",
    "description": "You are assigned the role of importer because you bring or plan to bring this AI system (or products containing it) into the EU market from a provider established outside the EU. As an importer, you must make sure that the provider has met all legal and technical EU AI Act requirements before the system is placed on the EU market, and you may be required to maintain compliance documentation.",
    "requiredTags": [
      "role:importer"
    ]
  }
]