[
  {
    "id": "o1",
    "article": "[Article 2: Scope, EU Artificial Intelligence Act](https://artificialintelligenceact.eu/article/2/)",
    "description": "**Personal/Non-Professional Use Is Out of Scope (AI Act Article 2)**\n\n**Explanation:**  \nAccording to Article 2(10) of the EU AI Act, the regulation does **not** apply to “obligations of deployers who are natural persons using AI systems in the course of a purely personal non-professional activity.”  \n\nThis means if you are a natural person using an AI system solely for personal, non-professional purposes, you are **not subject to the requirements** or obligations under the EU AI Act. This exemption reflects a conscious policy decision to exclude personal/private usage from regulatory coverage, focusing the law on professional and commercial activities.",
    "requiredTags": [
      "legal:non-professional"
    ],
    "order": 1
  },
  {
    "id": "o2",
    "article": "Article 22 (for High-Risk AI Systems)  Article 54 (for GPAI models)",
    "description": "For organizations not established in the EU but wishing to place a high-risk AI system or a general-purpose AI model (GPAI) on the EU market, the AI Act **requires the appointment of an Authorised Representative** established in the EU.\n\nKey Requirements:\n\n- Mandatory for non-EU providers of high-risk AI systems (e.g., under Annex I or III) and general-purpose AI models (unless open-source and without systemic risks).\n\n- The Authorised Representative must be empowered by written mandate before any product/model is made available in the EU.\n\n- Failure to appoint can result in market restriction, prohibition, and administrative fines up to EUR 15 million or 3% of global annual turnover.",
    "requiredAllTags": [
      "legal:non-eu-entity",
      "risk:gpai",
      "risk:high"
    ],
    "order": 1
  },
  {
    "id": "o3",
    "article": "[Article 2: Scope, EU Artificial Intelligence Act](https://artificialintelligenceact.eu/article/2/)",
    "description": "No compliance actions are required under the EU AI Act for systems used solely for military, scientific research, or national security purposes.\nThis exemption is established in Article 2 of the EU AI Act.\nNote: Monitoring for potential regulatory updates or changes in the use case is still advised, especially if the system's deployment context evolves.",
    "requiredTags": [
      "ai-system:exempt-military",
      "ai-system:exempt-research",
      "ai-system:exempt-security"
    ]
  }
]